In [2]:
#numpy is restricted only with int/decimal data type
#where pandas takes different data types(int,char,boolean,float)
#pandas shows the table like structure
#with pandas we can add more rows and columns where pandas df is mutable
#pandas comes with default indexing

In [3]:
#pandas has 2 basic data structures.
#a) series ----> work with 1 vector(1-d)
#b) data frames------>works with 2 vectors (2-d)(rows and columns)

In [4]:
import pandas as pd

# SERIES

In [5]:
#creating series object
#returns 1 vector structure
a=pd.Series([1,2,3,4])
a

0    1
1    2
2    3
3    4
dtype: int64

In [6]:
b=pd.Series([100,101,102,104])
b

0    100
1    101
2    102
3    104
dtype: int64

In [7]:
#pandas takes default index starting from 0
#wecann manually set index
#index value count should be as same as count of data so that we will not get any type of index errors
c=pd.Series([1,2,3,4],index=[10,20,30,40])
c

10    1
20    2
30    3
40    4
dtype: int64

In [8]:
c=pd.Series([1,2,3,4],index=['a','b','c','d'])
c

a    1
b    2
c    3
d    4
dtype: int64

In [9]:
#this throws the value error so commenting just for knowledge
# c=pd.Series([1,2,3,4,5],index=[11,12,13,14])
# c

In [10]:
#if we want to convert int to float for values
c=pd.Series([1,2,3,4],index=['a','b','c','d'],dtype=float)
c

a    1.0
b    2.0
c    3.0
d    4.0
dtype: float64

In [11]:
#we can also slice data in pandas data frame
c=pd.Series([1,2,3,4,5,6,7])
c

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int64

In [12]:
c[0]

1

In [13]:
print(c[0])
print(c[1])
print(c[2])

1
2
3

In [14]:
#retrieving data from dataframe
print(c[0:])

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int64

In [15]:
print(c[0:5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [16]:
#we can also pass numpy array into pandas data frame
import numpy as np
data = np.array([5,6,7,8,9])
df=pd.Series(data)
df

0    5
1    6
2    7
3    8
4    9
dtype: int32

In [17]:
#we can pass dict into pandas data frame where keys act as index and values as data
demodict={'name':'akhil','company':'UST'}
data=pd.Series(demodict)
data

name       akhil
company      UST
dtype: object

In [18]:
crct_dict={'name':'kohli','runs':243,'innings':3,'balls':56}
crct_df=pd.Series(crct_dict)
crct_df

name       kohli
runs         243
innings        3
balls         56
dtype: object

# DATAFRAME

In [19]:
#features of dataframe
#size is mutable
#labelled access rows and columns can be called easily
#can perform arthematic operations

In [20]:
#writing pandas frame syntax
df=pd.DataFrame([1,2,3,4])
df

   0
0  1
1  2
2  3
3  4

In [21]:
crct_dict={'name':['kohli','sachin'],'runs':[243,443],'innings':[3,2],'balls':[56,78]}
crct_df=pd.DataFrame(crct_dict)
crct_df

     name  runs  innings  balls
0   kohli   243        3     56
1  sachin   443        2     78

In [22]:
data=[['alex',10],['slava',20],['jeff',30]]
df=pd.DataFrame(data)
df

       0   1
0   alex  10
1  slava  20
2   jeff  30

In [23]:
#if we want to specify the column names partcularly,but the count of given column names count and actual count should be same 
data=[['alex',10],['slava',20],['jeff',30]]
df=pd.DataFrame(data,columns=['Name','Age'])
df

    Name  Age
0   alex   10
1  slava   20
2   jeff   30

In [24]:
#if we want to change int to float type for some column
df=pd.DataFrame(data,columns=['Name','Age'],dtype=float)
df

    Name   Age
0   alex  10.0
1  slava  20.0
2   jeff  30.0

In [25]:
data=[['alex',10,100],['slava',20,99],['jeff',30,45]]
df=pd.DataFrame(data,columns=['Name','Age','marks'])
df

    Name  Age  marks
0   alex   10    100
1  slava   20     99
2   jeff   30     45

In [26]:
df=pd.DataFrame(data,columns=['Name','Age','marks'],dtype=float)
df

    Name   Age  marks
0   alex  10.0  100.0
1  slava  20.0   99.0
2   jeff  30.0   45.0

In [27]:
df=pd.DataFrame(data,columns=['Name','Age','marks'],dtype=int)
df

    Name  Age  marks
0   alex   10    100
1  slava   20     99
2   jeff   30     45

In [28]:
# df=pd.DataFrame(data,columns=['Name','Age','marks'],dtype==2=float)
# df

In [29]:

#when we have dict the keys will be taken as column names automatically
data={'name':['akhil','raihan','neethu','prasanth','nagarjuna'],'age':[27,35,35,26,27]}
df=pd.DataFrame(data)
df

        name  age
0      akhil   27
1     raihan   35
2     neethu   35
3   prasanth   26
4  nagarjuna   27

In [30]:
#nan will be appending in df when there is some missing data
data=[{'a':1,'b':2},{'a':3,'b':4,'c':5}]
df=pd.DataFrame(data,dtype=int)
df

   a  b    c
0  1  2  NaN
1  3  4  5.0

In [31]:
#we can give index by setting index list
data=[{'a':1,'b':2},{'a':3,'b':4,'c':5}]
df=pd.DataFrame(data,index=['first','second'],dtype=int)
df

        a  b    c
first   1  2  NaN
second  3  4  5.0

In [32]:
#if we want only particluarcolumns we can manually enter that
df=pd.DataFrame(data,index=['first','second'],columns=['a'],dtype=int)
df

        a
first   1
second  3

In [33]:
#whe there is no column present which you are specifying it takes nan by giving that column name
df=pd.DataFrame(data,index=['first','second'],columns=['a',"b1"],dtype=int)
df

        a  b1
first   1 NaN
second  3 NaN

# indexing and slicing

In [34]:
#we have loc and iloc
#loc describes location based and iloc describes index based
#loc takes 2 args rows,columns
#pd.loc[:,'column_name']
#pd.iloc[:,column_index]

In [35]:
df = pd.DataFrame(np.random.randn(8,4),columns=['a','b','c','d'])
df

          a         b         c         d
0  0.091346  0.104874  0.407527  0.736378
1 -0.591335 -1.104241  0.624796  1.641839
2 -0.873300  0.490724 -0.511927  0.376103
3  0.423585 -1.138326 -1.347903  0.855431
4 -0.267512 -0.114863  0.022435  0.452715
5  1.046064  0.450088 -1.151311 -0.291133
6  1.083744  0.354436  1.587461 -0.534299
7  0.401313  0.251423 -1.088981 -0.519196

In [36]:
#loc method
print(df.loc[:,'a'])

0    0.091346
1   -0.591335
2   -0.873300
3    0.423585
4   -0.267512
5    1.046064
6    1.083744
7    0.401313
Name: a, dtype: float64

In [37]:
print(df.loc[:,'b'])
print(df.loc[:,'c'])

0    0.104874
1   -1.104241
2    0.490724
3   -1.138326
4   -0.114863
5    0.450088
6    0.354436
7    0.251423
Name: b, dtype: float64
0    0.407527
1    0.624796
2   -0.511927
3   -1.347903
4    0.022435
5   -1.151311
6    1.587461
7   -1.088981
Name: c, dtype: float64

In [38]:
#if ou want to takes 2 columns at a time
print(df.loc[:,['a','b']])

          a         b
0  0.091346  0.104874
1 -0.591335 -1.104241
2 -0.873300  0.490724
3  0.423585 -1.138326
4 -0.267512 -0.114863
5  1.046064  0.450088
6  1.083744  0.354436
7  0.401313  0.251423

In [39]:
#iloc method
print(df.iloc[:,3])

0    0.736378
1    1.641839
2    0.376103
3    0.855431
4    0.452715
5   -0.291133
6   -0.534299
7   -0.519196
Name: d, dtype: float64

In [40]:
print(df.iloc[:,:])

          a         b         c         d
0  0.091346  0.104874  0.407527  0.736378
1 -0.591335 -1.104241  0.624796  1.641839
2 -0.873300  0.490724 -0.511927  0.376103
3  0.423585 -1.138326 -1.347903  0.855431
4 -0.267512 -0.114863  0.022435  0.452715
5  1.046064  0.450088 -1.151311 -0.291133
6  1.083744  0.354436  1.587461 -0.534299
7  0.401313  0.251423 -1.088981 -0.519196

In [41]:
print(df.iloc[:,[2,3]])

          c         d
0  0.407527  0.736378
1  0.624796  1.641839
2 -0.511927  0.376103
3 -1.347903  0.855431
4  0.022435  0.452715
5 -1.151311 -0.291133
6  1.587461 -0.534299
7 -1.088981 -0.519196

In [42]:
print(df.iloc[1:5,0:2])

          a         b
1 -0.591335 -1.104241
2 -0.873300  0.490724
3  0.423585 -1.138326
4 -0.267512 -0.114863

In [43]:
print(df.iloc[3:6,1:3])

          b         c
3 -1.138326 -1.347903
4 -0.114863  0.022435
5  0.450088 -1.151311

In [44]:
df

          a         b         c         d
0  0.091346  0.104874  0.407527  0.736378
1 -0.591335 -1.104241  0.624796  1.641839
2 -0.873300  0.490724 -0.511927  0.376103
3  0.423585 -1.138326 -1.347903  0.855431
4 -0.267512 -0.114863  0.022435  0.452715
5  1.046064  0.450088 -1.151311 -0.291133
6  1.083744  0.354436  1.587461 -0.534299
7  0.401313  0.251423 -1.088981 -0.519196

# negative indexing

In [46]:
print(df.iloc[:,-3:-1])

          b         c
0  0.104874  0.407527
1 -1.104241  0.624796
2  0.490724 -0.511927
3 -1.138326 -1.347903
4 -0.114863  0.022435
5  0.450088 -1.151311
6  0.354436  1.587461
7  0.251423 -1.088981

In [47]:
print(df.iloc[:,-1:-3])

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6, 7]

In [48]:
print(df.iloc[:,-4:])

          a         b         c         d
0  0.091346  0.104874  0.407527  0.736378
1 -0.591335 -1.104241  0.624796  1.641839
2 -0.873300  0.490724 -0.511927  0.376103
3  0.423585 -1.138326 -1.347903  0.855431
4 -0.267512 -0.114863  0.022435  0.452715
5  1.046064  0.450088 -1.151311 -0.291133
6  1.083744  0.354436  1.587461 -0.534299
7  0.401313  0.251423 -1.088981 -0.519196